[

     {
    "title":"তাওবাহ ও ইসতেগফার",
    "bangla":"'আস্‌তাগফিরুল্লা হাল্লাজি লা ইলাহা ইল্লা হুওয়াল হাইয়্যুল কইয়্যুমু ওয়া আতুবু ইলায়হি।'",
    "arabic":" أَسْتَغْفِرُ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَىُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ",
    "meaning":"'আমি ওই আল্লাহর কাছে ক্ষমা চাই, যিনি ছাড়া প্রকৃতপক্ষে কোনো মাবুদ নেই, তিনি চিরঞ্জীব, চিরস্থায়ী এবং তাঁর কাছেই (তাওবাহ করে) ফিরে আসি।'",
    "reference":"তিরমিজি"
  },
  
  {
    "title":"দোয়া কুনুত",
    "bangla":"আল্লাহুম্মা ইন্না নাসতায়িনুকা ওয়া নাসতাগ ফিরুকা, ওয়ানু’মিনু বিকা ওয়া নাতাওয়াক্কালু আলাইকা ওয়া নুছনি আলাইকাল খাইর। ওয়া নাসকুরুকা ওয়ালা নাক ফুরুকা, ওয়ানাখলাউ উয়ানাত রুকু মাইয়্যাফযুরুকা। আল্লাহুম্মা ইয়্যাকানা’বুদু ওয়ালাকা নুছল্লি, ওয়ানাস জুদু ওয়া ইলাইকা নাসয়া; ওয়া নাহফিদু ওয়া নারজু রাহমাতাকা, ওয়া নাখশা আজাবাকা; ইন্না আজাবাকা বিলকুফফারি মুলহিক্।",
    "arabic":"اَللَّهُمَّ اِنَّ نَسْتَعِيْنُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِىْ عَلَيْكَ الْخَيْرَ وَنَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَّفْجُرُكَ-اَللَّهُمَّ اِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّىْ وَنَسْجُدُ وَاِلَيْكَ نَسْعَى وَنَحْفِدُ وَنَرْجُوْ رَحْمَتَكَ وَنَخْشَى عَذَابَكَ اِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحِقٌ",
    "meaning":"হে আল্লাহ! আমরা তোমারই সাহায্য চাই। তোমারই নিকট ক্ষমা চাই, তোমারই প্রতি ঈমান রাখি, তোমারই ওপর ভরসা করি এবং সকল মঙ্গল তোমারই দিকে ন্যস্ত করি। আমরা তোমার কৃতজ্ঞ হয়ে চলি, অকৃতজ্ঞ হই না। হে আল্লাহ! আমরা তোমারই দাসত্ব করি, তোমারই জন্য নামাজ পড়ি এবং তোমাকেই সিজদাহ করি। আমরা তোমারই দিকে দৌড়াই ও এগিয়ে চলি। আমরা তোমারই রহমত আশা করি এবং তোমার আযাবকে ভয় করি। আর তোমার আযাবতো কাফেরদের জন্যই র্নিধারিত।",
    "reference":""
  },

  {
    "title":"আয়াতুল কুরসির",
    "bangla":"আল্লাহু লা ইলা-হা ইল্লা হুওয়াল হাইয়্যুল কাইয়ুম, লা তা’খুযুহু সিনাতুঁও ওয়ালা নাউম। লাহু মা-ফিসসামা-ওয়া-তি ওয়ামা ফিল আরদ্ব। মান জাল্লাজি ইয়াশফা’উ ইনদাহু ইল্লা বিইজনিহি। ইয়া’লামু মা বাইনা আইদিহিম ওয়ামা খালফাহুম। ওয়ালা ইয়ুহিতুনা বিশাইইম মিন্ ইলমিহি ইল্লা বিমা- শাআ। ওয়াসি‘আ কুরসিয়্যুহুস সামা-ওয়াতি ওয়াল আরদ্ব। ওয়ালা ইয়াউদুহু হিফজুহুমা ওয়া হুয়াল আলিয়্যূল আজিম।",
    "arabic":" اَللهُ لآ إِلهَ إِلاَّ هُوَ الْحَىُّ الْقَيُّوْمُ، لاَ تَأْخُذُهُ سِنَةٌ وَّلاَ نَوْمٌ، لَهُ مَا فِى السَّمَاوَاتِ وَمَا فِى الْأَرْضِ، مَنْ ذَا الَّذِىْ يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ، يَعْلَمُ مَا بَيْنَ أَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيْطُوْنَ بِشَيْئٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَآءَ، وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ، وَلاَ يَئُودُهُ حِفْظُهُمَا وَ هُوَ الْعَلِيُّ الْعَظِيْمُ-",
    "meaning":"আল্লাহ, যিনি ব্যতীত কোনো উপাস্য নেই। যিনি চিরঞ্জীব ও বিশ্বচরাচরের ধারক। তন্দ্রা বা নিদ্রা তাঁকে পাকড়াও করতে পারে না। আসমান ও জমিনে যা কিছু আছে সবকিছু তারই মালিকানাধীন। তাঁর হুকুম ব্যতীত এমন কে আছে যে তাঁকে সুপারিশ করতে পারে? তাদের সম্মুখে ও পেছনে যা কিছু আছে সবকিছুই তিনি জানেন। তাঁর জ্ঞানসমুদ্র হতে তারা কিছুই আয়ত্ত করতে পারে না, কেবল যতটুকু তিনি দিতে ইচ্ছা করেন তা ব্যতীত। তাঁর কুরসি সমগ্র আসমান ও জমিন পরিবেষ্টন করে আছে। আর সেগুলোর তত্ত্বাবধান তাঁকে মোটেই শ্রান্ত করে না। তিনি সর্বোচ্চ ও মহান।",
    "reference":""
  },

   {
    "title":"সাইয়েদুল ইসতেগফার",
    "bangla":"আল্লাহুম্মা আংতা রাব্বি লা ইলাহা ইল্লা আংতা খালাক্কতানি ওয়া আনা আবদুকা ওয়া আনা আলা আহ্দিকা ওয়া ওয়াদিকা মাসতাতাতু আউজুবিকা মিন শাররি মা সানাতু আবুউলাকা বিনিমাতিকা আলাইয়্যা ওয়া আবুউলাকা বিজাম্বি ফাগ্ফিরলি ফা-ইন্নাহু লা ইয়াগফিরুজ জুনুবা ইল্লা আংতা।",
    "arabic":"اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
    "meaning":"'হে আল্লাহ! তুমিই আমার প্রতিপালক। তুমি ছাড়া কোনো ইলাহ নেই। তুমিই আমাকে সৃষ্টি করেছ। আমি তোমারই বান্দা আমি যথাসাধ্য তোমার সঙ্গে প্রতিজ্ঞা ও অঙ্গীকারের উপর আছি। আমি আমার সব কৃতকর্মের কুফল থেকে তোমার কাছে আশ্রয় চাই। তুমি আমার প্রতি তোমার যে নেয়ামত দিয়েছ তা স্বীকার করছি। আর আমার কৃত গোনাহের কথাও স্বীকার করছি। তুমি আমাকে ক্ষমা করে দাও। কারন তুমি ছাড়া কেউ গোনাহ ক্ষমা করতে পারবে না।",
    "reference":"বুখারি"
  },
    
  {
     "title":"বিপদ থেকে বাঁচতে দোয়া",
      "bangla":" ‘লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নি কুনতু মিনাজ জ্বলিমিন।’",
      "arabic":"لَا اِلَهَ اِلَّا اَنْتَ سُبْحَانَكَ اِنِّى كَنْتُ مِنَ الظَّالِمِيْنَ",
      "meaning":"হে আল্লাহ! তুমি ছাড়া কোনো সত্য উপাস্য নেই; আমি তোমার পবিত্রতা বর্ণনা করছি। নিঃসন্দেহে আমি জালিমদের অন্তর্ভুক্ত।’",
    "reference":"তিরমিজি"
  },

   {
    "title":"যে দোয়া ও আমলে চিন্তামুক্ত থাকবে মুমিন",
    "bangla":"হাসবিয়াল্লাহু লা ইলাহা ইল্লা হুয়া আলাইহি তাওয়াক্‌কাল্‌তু ওয়া হুয়া রাব্বুল আরশিল আজিম।",
    "arabic":"حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "meaning":"আল্লাহ তাআলাই আমার জন্য যথেষ্ট। তিনি ব্যতিত কোনো উপাস্য নেই। তারই ওপর আমি ভরসা করি। তিনিই মহা আরশের অধিপাতি।'",
    "reference":"আবু দাউদ"
  },

   {
    "title":"জুমআর দিন দরূদের বিশেষ আমল ও ফজিলত",
    "bangla":"আল্লাহুম্মা সাল্লি ওয়া সাল্লিম আলা নাবিয়্যিনা মুহাম্মাদ।",
    "arabic":"اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبِيِّنَا مُحَمَّد",
    "meaning":"‘হে আল্লাহ! আপনি আমাদের নবি মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লামকে রহমত ও শান্তি দান করুন।’",
    "reference":"তারগিব"
  },

   {
    "title":"ফরজ নামাজের পর যে দোয়া পড়তে বলেছেন নবীজি",
    "bangla":"আল্লাহুম্মা আ-ইন্নি আলা জিকরিকা ওয়া শুকরিকা ওয়া হুসনি ইবাদাতিক।’",
    "arabic":"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكِ وَحُسْنِ عِبَادَتِكِ",
    "meaning":"হে আল্লাহ! আমাকে আপনার জিকির ও শোকর আদায় করার তাওফিক দিন এবং উত্তমরূপে আপনার ইবাদত করার তাওফিক দান করুন।",
    "reference":"হাদিস : ১৫২২; নাসায়ি, হাদিস : ০৩/৫৩"
  },
  
  {
      "title":"নেককার স্ত্রী পাওয়ার দোয়া",
      "bangla":"‘রাব্বানা হাব্লানা মিন আযওয়াঝিনা ওয়া জুর্রিয়াতিনা কুর্রাতা আইয়ুনিও ওয়াঝআলনা লিলমুত্তাক্বিনা ইমামা।’",
      "arabic":"رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "meaning":"‘হে আমাদের প্রতিপালক! আপনি আমাদের এমন স্ত্রী ও সন্তান দান করুন। যারা আমাদের চোখ জুড়িয়ে দেয় আর আমাদেরকে (পুরুষদেরকে) মুত্তাকি লোকদের নেতা বানিয়ে দাও।’)",
    "reference":"সুরা ফুরক্বান : আয়াত ৭৪"
  },


  {
    "title":"ঘুমানোর আগের দোয়া",
    "bangla":" ‘আল্লাহুম্মা বিসমিকা আমুতু ওয়া আহইয়া।’",
    "arabic":"اَللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",
    "meaning":"‘হে আল্লাহ! আমি তোমারই নামে ঘুমাই এবং তোমার নামেই জাগ্রত হই।’",
    "reference":"সহিহ বুখারি : ৩৩১৪"
  },

  {
    "title":"ঘুম থেকে জাগার পরের দোয়া",
    "bangla":"আলহামদু লিল্লাহিল্লাজি আহইয়া না বা’দা মা আমা তানা ওয়া ইলাইহিন নুশূর।",
    "arabic":"لْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "meaning":"‘সমস্ত প্রশংসা সেই আল্লাহর, যিনি ঘুমের পর আমাদের জাগ্রত করেছেন এবং আমাদের তার কাছেই ফিরে যেতে হবে।’ আবার যখন মহানবী (সা.) ঘুম থেকে সজাগ হতেন, তখন এই দোয়া বলতেন।",
    "reference":"বুখারি : ৬৩১২"
  },

  {
    "title":"জ্ঞান রিজিক বৃদ্ধির দোয়া",
    "bangla":"আল্লাহুম্মা ইন্নি আসআলুকা ইলমান নাফিআ ওয়া রিযকান তাইয়্যেবা ওয়া আমালান মুতাক্বাব্বালা।’",
    "arabic":"اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
    "meaning":"‘হে আল্লাহ্! আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র রিজিক ও এবং কবুল হওয়ার যোগ্য কর্মতৎপরতা প্রার্থনা করি।’",
    "reference":"ইবনে মাজাহ, মুসনাদে আহমাদ"
  },

  {
    "title":"ঘর থেকে বের হওয়ার সময়ের দোয়া",
    "bangla":"বিসমিল্লাহি তাওয়াক্কালতু আলাল্লাহ, লা-হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ।",
    "arabic":" بِسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ وَ لَا حَوْلَ وَ لَا قُوَّةَ اِلَّا بِاللَّهِ",
    "meaning":" আল্লাহর নামে, আল্লাহ তাআলার ওপরই নির্ভর করলাম, আল্লাহ তাআলার সাহায্য ছাড়া বিরত থাকা ও মঙ্গল লাভ করার শক্তি কারো নেই।",
    "reference":""
  },

  {
    "title":"টয়লেটে যাওয়ার আগে দোয়া",
    "bangla":" আল্লাহুম্মা ইন্নি আউজুবিকা মিনাল খুবছি ওয়াল খাবায়িছ।",
    "arabic":"اَللَّهُمَّ اِ نِّىْ اَعُوْذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
    "meaning":"হে আল্লাহ, নিশ্চয়ই আমি আপনার কাছে পুরুষ ও নারী শয়তানের অনিষ্ট তথা ক্ষতি থেকে আশ্রয় চাই।",
    "reference":""
  },

  {
    "title":" টয়লেট থেকে বের হওয়ার পর দোয়া",
    "bangla":"গোফরানাকা।",
    "arabic":" ﻏُﻔْﺮَﺍﻧَﻚَ",
    "meaning":" (হে আল্লাহ,) আপনার কাছে ক্ষমা চাই।",
    "reference":""
  },

  {
    "title":"মসজিদে প্রবেশের দোয়া",
    "bangla":"আল্লাহুম্মাফতাহ লি আবওয়াবা রহমাতিক।",
    "arabic":"اللهُمَّ افْتَحْ لِى أَبْوَابَ رَحْمَتِكَ",
    "meaning":"হে আল্লাহ, আমার জন্য আপনার রহমতের দরজাসমূহ খুলে দিন।",
    "reference":""
  },

   {
    "title":"মসজিদ থেকে বের হওয়ার দোয়া",
    "bangla":" আল্লাহুম্মা ইন্নি আসআলুকা মিন ফাদলিক।",
    "arabic":"اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك",
    "meaning":"হে আল্লাহ, আমি আপনার অনুগ্রহপ্রত্যাশী।",
    "reference":""
  },

   {
    "title":" স্ত্রী সহবাসের দোয়া",
    "bangla":"বিছমিল্লা-হি আল্লা-হুম্মা জান্নিব-নাশ শাইত্বানা ওয়া জান্নিবিশ শাইত্বানা মা রাজাকতানা।",
    "arabic":"بِسْمِ اللّهِ اللّهُمَّ جَنِّبْنَا الشَّيْطَانَ وَ جَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا",
    "meaning":"হে আল্লাহ, তোমার নামে আরম্ভ করছি, তুমি আমাদের নিকট হতে শয়তানকে দূরে রাখ। আমাদের এ মিলনের ফলে যে সন্তান দান করবে, তা হতেও শয়তানকে দূরে রাখো।",
    "reference":""
  },

   {
    "title":"লাইলাতুল কদরে যে দোয়া পড়বেন",
    "bangla":"‘আল্লাহুম্মা ইন্নাকা আফুউন কারিমুন তুহিব্বুল আফওয়া ফা'ফু আন্নি।’",
    "arabic":"اللَّهمَّ إنَّك عفُوٌّ كريمٌ تُحِبُّ العفْوَ، فاعْفُ عنِّي",
    "meaning":"‘হে আল্লাহ, আপনি মহানুভব ক্ষমাশীল এবং ক্ষমা করতে পছন্দ করেন, অতএব আমাকে ক্ষমা করুন।’ ",
    "reference":"তিরমিজি: ৩৫১৩"
  }
  
]
