[
  {
    "title":"তওবা করার দোয়া",
     "bangla": "আসতাগফিরুল্লা-হাল্লাযী লা-ইলা-হা ইল্লা হুওয়াল হা’ইয়ুল ক্বাইয়ূমু ওয়া আতুবু ইলাইহি।",
     "arabic": "أَسْتَغْفِرُ اللَّهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيّوُمُ وَأَتُوبُ إِلَيهِ\n",
    "meaning": "মহান আল্লাহর কাছে আমি ক্ষমা চাই, যিনি ছাড়া কোনো উপাস্য নেই, যিনি চিরঞ্জীব, চিরস্থায়ী এবং আমি তাঁর কাছে তওবা করি।’ জায়দ (রা.) রাসুল (স.)-কে বলতে শুনেছেন, যে ব্যক্তি এই দোয়া পড়ে, তাকে ক্ষমা করে দেওয়া হয়, যদিও সে রণক্ষেত্র থেকে পলায়ন করে থাকে। "
  },
  {
    "title":"দোয়া কুনুত",
    "bangla":"আল্লাহুম্মা ইন্না নাসতায়িনুকা ওয়া নাসতাগ ফিরুকা, ওয়ানু’মিনু বিকা ওয়া নাতাওয়াক্কালু আলাইকা ওয়া নুছনি আলাইকাল খাইর। ওয়া নাসকুরুকা ওয়ালা নাক ফুরুকা, ওয়ানাখলাউ উয়ানাত রুকু মাইয়্যাফযুরুকা। আল্লাহুম্মা ইয়্যাকানা’বুদু ওয়ালাকা নুছল্লি, ওয়ানাস জুদু ওয়া ইলাইকা নাসয়া; ওয়া নাহফিদু ওয়া নারজু রাহমাতাকা, ওয়া নাখশা আজাবাকা; ইন্না আজাবাকা বিলকুফফারি মুলহিক্।",
    "arabic":"اَللَّهُمَّ اِنَّ نَسْتَعِيْنُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُثْنِىْ عَلَيْكَ الْخَيْرَ وَنَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَّفْجُرُكَ-اَللَّهُمَّ اِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّىْ وَنَسْجُدُ وَاِلَيْكَ نَسْعَى وَنَحْفِدُ وَنَرْجُوْ رَحْمَتَكَ وَنَخْشَى عَذَابَكَ اِنَّ عَذَابَكَ بِالْكُفَّارِ مُلْحِقٌ",
    "meaning":"হে আল্লাহ! আমরা তোমারই সাহায্য চাই। তোমারই নিকট ক্ষমা চাই, তোমারই প্রতি ঈমান রাখি, তোমারই ওপর ভরসা করি এবং সকল মঙ্গল তোমারই দিকে ন্যস্ত করি। আমরা তোমার কৃতজ্ঞ হয়ে চলি, অকৃতজ্ঞ হই না। হে আল্লাহ! আমরা তোমারই দাসত্ব করি, তোমারই জন্য নামাজ পড়ি এবং তোমাকেই সিজদাহ করি। আমরা তোমারই দিকে দৌড়াই ও এগিয়ে চলি। আমরা তোমারই রহমত আশা করি এবং তোমার আযাবকে ভয় করি। আর তোমার আযাবতো কাফেরদের জন্যই র্নিধারিত।"
  },
  {
     "title":"বিপদ থেকে বাঁচতে দোয়া",
      "bangla":" ‘লা ইলাহা ইল্লা আনতা সুবহানাকা ইন্নি কুনতু মিনাজ জ্বলিমিন।’",
      "arabic":"لَا اِلَهَ اِلَّا اَنْتَ سُبْحَانَكَ اِنِّى كَنْتُ مِنَ الظَّالِمِيْنَ",
      "meaning":"হে আল্লাহ! তুমি ছাড়া কোনো সত্য উপাস্য নেই; আমি তোমার পবিত্রতা বর্ণনা করছি। নিঃসন্দেহে আমি জালিমদের অন্তর্ভুক্ত।’ (তিরমিজি)"
  },
  {
      "title":"নেককার স্ত্রী পাওয়ার দোয়া",
      "bangla":"‘রাব্বানা হাব্লানা মিন আযওয়াঝিনা ওয়া জুর্রিয়াতিনা কুর্রাতা আইয়ুনিও ওয়াঝআলনা লিলমুত্তাক্বিনা ইমামা।’",
      "arabic":"رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "meaning":"‘হে আমাদের প্রতিপালক! আপনি আমাদের এমন স্ত্রী ও সন্তান দান করুন। যারা আমাদের চোখ জুড়িয়ে দেয় আর আমাদেরকে (পুরুষদেরকে) মুত্তাকি লোকদের নেতা বানিয়ে দাও।’ (সুরা ফুরক্বান : আয়াত ৭৪)"
    
  }
]
